public class Main {
    public static void main(String[] args)
    {
        // 문제 1)
        // 1,2,3 을 byte형 변수 3개와 System.out.printf() 문을 이용하여 출력하세요, 출력결과 : 1,2,3

        // 문제 2)
        //   1
        //   2
        //   3
        // 문제 1의 byte 형 변수 3개를 이용하여 위 와 같은 형식(3칸 확보후 오른쪽 정렬 출력)

        // 문제 3)
        // 문자 a, b, c 를 char형 변수 3개를 이용하여 출력하세요
        char a = 'a';
        char b = 'b';
        char c = 'c';
        System.out.printf("%c, %c, %c\n", a, b, c);

        // 문제 4)
        // 실수 42.195 가 저장될 변수 dist를 가장 알맞는 데이터 타입으로 선언하고 대입하세요

        // 문제 5)
        // 위 문제 4)에서 선언한 변수를 byte 형 변수에 형변환하여 대입하세요

        // 문제 6)
        // String 형 변수 1개에 "안녕하세요" , "저는 자바를 공부하고 있습니다" 를 저장하고 하나의 출력문을 사용하여 각각 한줄씩 출력하세요
        // 출력 예 )
        // 안녕하세요
        // 저는 자바를 공부하고 있습니다
        String strOut = "안녕하세요\n저는 자바를 공부하고 있습니다";
        System.out.println(strOut);

        // 문제 7)
        // 문자열 형 변수 2개에 각각 "안녕하세요", "저는 자바를 공부하고 있습니다"를 대입하고,
        // 한번의 출력문을 이용해 한줄에 연이어 출력하는 코드를 작성하세요
        // 단, System.out.println()과  System.out.printf()를 둘 다 이용하여 각각 한줄씩 출력해보도록 하세요
        // 출력 예)
        // 안녕하세요 저는 자바를 공부하고 있습니다
        // 안녕하세요 저는 자바를 공부하고 있습니다

        // 문제 8)
        // 2개의 정수를 입력받아 다음 출력 예와 같이 출력하세요, Scanner 클래스를 이용하세요.
        // 출력 예 )
        // a=1, b=2, a+b=3

    }
}